# 10分钟Pandas

通过传递值列表创建序列，创建默认整数索引,第一列就是整数索引，第二列是值，值的类型默认为 float64。

In [2]:
import pandas as pd
import numpy as np
series = pd.Series([1,2,3,np.nan,5])
series

0    1.0
1    2.0
2    3.0
3    NaN
4    5.0
dtype: float64

通过传入 Numpy 数组创建一个 DataFrame。第一列是数据是建索引，第一行是标签行。

In [4]:
data = pd.date_range('20220123',periods=7)
data

DatetimeIndex(['2022-01-23', '2022-01-24', '2022-01-25', '2022-01-26',
               '2022-01-27', '2022-01-28', '2022-01-29'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(7,4),index=data,columns=['1','2','3','4'])
df

                   1         2         3         4
2022-01-23  2.293730  0.217097 -1.489770  0.042462
2022-01-24 -1.160795 -0.259789 -1.390047 -0.071024
2022-01-25  0.956457  0.250320  1.871723 -0.489799
2022-01-26 -1.565191 -1.099889 -0.232267 -1.119627
2022-01-27 -1.032809 -0.597634  0.683309  0.732652
2022-01-28 -1.352415  0.789602  0.795431  0.979990
2022-01-29 -0.666001  1.324261 -0.589492 -1.734960

创建 DataaFrame 也可以通过传入字典的方式。

In [10]:
df1 = pd.DataFrame(
                    {'学分':2.0,
                     '学号':['B20040101','B20040102','B20040103','B20040104'],
                     '绩点':np.array([2.5,3.0,4.5,4.0])
                    }
                   )
df1

    学分         学号   绩点
0  2.0  B20040101  2.5
1  2.0  B20040102  3.0
2  2.0  B20040103  4.5
3  2.0  B20040104  4.0

In [11]:
df1.dtypes

学分    float64
学号     object
绩点    float64
dtype: object

查看前五行和后面几行

In [12]:
df.head()

                   1         2         3         4
2022-01-23  2.293730  0.217097 -1.489770  0.042462
2022-01-24 -1.160795 -0.259789 -1.390047 -0.071024
2022-01-25  0.956457  0.250320  1.871723 -0.489799
2022-01-26 -1.565191 -1.099889 -0.232267 -1.119627
2022-01-27 -1.032809 -0.597634  0.683309  0.732652

In [13]:
df.tail(2)

                   1         2         3        4
2022-01-28 -1.352415  0.789602  0.795431  0.97999
2022-01-29 -0.666001  1.324261 -0.589492 -1.73496

展示索引、行

In [14]:
df.index

DatetimeIndex(['2022-01-23', '2022-01-24', '2022-01-25', '2022-01-26',
               '2022-01-27', '2022-01-28', '2022-01-29'],
              dtype='datetime64[ns]', freq='D')

In [15]:
df.columns

Index(['1', '2', '3', '4'], dtype='object')

展示数据的快速统计摘要

In [16]:
df.describe()

              1         2         3         4
count  7.000000  7.000000  7.000000  7.000000
mean  -0.361003  0.089138 -0.050159 -0.237186
std    1.437607  0.823177  1.234129  0.967278
min   -1.565191 -1.099889 -1.489770 -1.734960
25%   -1.256605 -0.428712 -0.989769 -0.804713
50%   -1.032809  0.217097 -0.232267 -0.071024
75%    0.145228  0.519961  0.739370  0.387557
max    2.293730  1.324261  1.871723  0.979990

数据转置，行列交换

In [17]:
df.T

,2022-01-23,2022-01-24,2022-01-25,2022-01-26,2022-01-27,2022-01-28,2022-01-29
1,2.293730,-1.160795,0.956457,-1.565191,-1.032809,-1.352415,-0.666001
2,0.217097,-0.259789,0.250320,-1.099889,-0.597634,0.789602,1.324261
3,-1.489770,-1.390047,1.871723,-0.232267,0.683309,0.795431,-0.589492
4,0.042462,-0.071024,-0.489799,-1.119627,0.732652,0.979990,-1.734960

按轴排序,0代表第一列，1代表第一行，好像效果都是逆序

In [22]:
df.sort_index(axis=0,ascending=False)

                   1         2         3         4
2022-01-29 -0.666001  1.324261 -0.589492 -1.734960
2022-01-28 -1.352415  0.789602  0.795431  0.979990
2022-01-27 -1.032809 -0.597634  0.683309  0.732652
2022-01-26 -1.565191 -1.099889 -0.232267 -1.119627
2022-01-25  0.956457  0.250320  1.871723 -0.489799
2022-01-24 -1.160795 -0.259789 -1.390047 -0.071024
2022-01-23  2.293730  0.217097 -1.489770  0.042462

In [23]:
df.sort_index(axis=1,ascending=False)

                   4         3         2         1
2022-01-23  0.042462 -1.489770  0.217097  2.293730
2022-01-24 -0.071024 -1.390047 -0.259789 -1.160795
2022-01-25 -0.489799  1.871723  0.250320  0.956457
2022-01-26 -1.119627 -0.232267 -1.099889 -1.565191
2022-01-27  0.732652  0.683309 -0.597634 -1.032809
2022-01-28  0.979990  0.795431  0.789602 -1.352415
2022-01-29 -1.734960 -0.589492  1.324261 -0.666001

按值排序

In [25]:
df.sort_values(by='4') #按照列号为4的那一列排序

                   1         2         3         4
2022-01-29 -0.666001  1.324261 -0.589492 -1.734960
2022-01-26 -1.565191 -1.099889 -0.232267 -1.119627
2022-01-25  0.956457  0.250320  1.871723 -0.489799
2022-01-24 -1.160795 -0.259789 -1.390047 -0.071024
2022-01-23  2.293730  0.217097 -1.489770  0.042462
2022-01-27 -1.032809 -0.597634  0.683309  0.732652
2022-01-28 -1.352415  0.789602  0.795431  0.979990

挑出一行,如果我这里没用 3 的话，那么 df['A'] 等价于 df.A

In [29]:
df['3']

2022-01-23   -1.489770
2022-01-24   -1.390047
2022-01-25    1.871723
2022-01-26   -0.232267
2022-01-27    0.683309
2022-01-28    0.795431
2022-01-29   -0.589492
Freq: D, Name: 3, dtype: float64

用切片的方法挑出行

In [30]:
df[:2] #直接切片

                   1         2         3         4
2022-01-23  2.293730  0.217097 -1.489770  0.042462
2022-01-24 -1.160795 -0.259789 -1.390047 -0.071024

In [31]:
df['20220124':'20220126'] #标签切片方法

                   1         2         3         4
2022-01-24 -1.160795 -0.259789 -1.390047 -0.071024
2022-01-25  0.956457  0.250320  1.871723 -0.489799
2022-01-26 -1.565191 -1.099889 -0.232267 -1.119627

用标签的方法获取横截面

In [32]:
df.loc[data[1]] #索引为1的行的数据

1   -1.160795
2   -0.259789
3   -1.390047
4   -0.071024
Name: 2022-01-24 00:00:00, dtype: float64

按标签在多轴上选择，前面取行，后面取列

In [33]:
df.loc[:,['1','3']]

                   1         3
2022-01-23  2.293730 -1.489770
2022-01-24 -1.160795 -1.390047
2022-01-25  0.956457  1.871723
2022-01-26 -1.565191 -0.232267
2022-01-27 -1.032809  0.683309
2022-01-28 -1.352415  0.795431
2022-01-29 -0.666001 -0.589492

快速锁定某个地方的值

In [35]:
df.at[data[1],'1']

-1.1607945875115697

通过传递的整数的位置选择

In [36]:
df.iloc[1] #索引为1的行

1   -1.160795
2   -0.259789
3   -1.390047
4   -0.071024
Name: 2022-01-24 00:00:00, dtype: float64

通过整数切片,前面取行，后面取列

In [37]:
df.iloc[1:3,0:3]

                   1         2         3
2022-01-24 -1.160795 -0.259789 -1.390047
2022-01-25  0.956457  0.250320  1.871723

通过整数位置列表

In [40]:
df.iloc[[0,1],[0,2]] #索引为0、1的行，为0、2的列

                   1         3
2022-01-23  2.293730 -1.489770
2022-01-24 -1.160795 -1.390047

直接获取值

In [41]:
df.iloc[0,0]
#df.iat[0,0]

2.2937304994380012

筛选特性

In [42]:
df[df['1']>0.5] #列标签为1的大于0.5的所有行

                   1         2         3         4
2022-01-23  2.293730  0.217097 -1.489770  0.042462
2022-01-25  0.956457  0.250320  1.871723 -0.489799

直接展示所有满足条件的值

In [43]:
df[df>0.5]

                   1         2         3         4
2022-01-23  2.293730       NaN       NaN       NaN
2022-01-24       NaN       NaN       NaN       NaN
2022-01-25  0.956457       NaN  1.871723       NaN
2022-01-26       NaN       NaN       NaN       NaN
2022-01-27       NaN       NaN  0.683309  0.732652
2022-01-28       NaN  0.789602  0.795431  0.979990
2022-01-29       NaN  1.324261       NaN       NaN

设置新列会自动按索引对其数据

In [48]:
a = pd.Series([3,7,3,2,4,1,6],index=pd.date_range('20220123',periods=7))
df['5'] = a
df

                   1         2         3         4  5
2022-01-23  2.293730  0.217097 -1.489770  0.042462  3
2022-01-24 -1.160795 -0.259789 -1.390047 -0.071024  7
2022-01-25  0.956457  0.250320  1.871723 -0.489799  3
2022-01-26 -1.565191 -1.099889 -0.232267 -1.119627  2
2022-01-27 -1.032809 -0.597634  0.683309  0.732652  4
2022-01-28 -1.352415  0.789602  0.795431  0.979990  1
2022-01-29 -0.666001  1.324261 -0.589492 -1.734960  6

通过标签设置值

In [53]:
df.at[data[0],'5'] = 10
df

                     1         2         3         4   5
2022-01-23  100.000000  0.217097 -1.489770  0.042462  10
2022-01-24   -1.160795 -0.259789 -1.390047 -0.071024   7
2022-01-25    0.956457  0.250320  1.871723 -0.489799   3
2022-01-26   -1.565191 -1.099889 -0.232267 -1.119627   2
2022-01-27   -1.032809 -0.597634  0.683309  0.732652   4
2022-01-28   -1.352415  0.789602  0.795431  0.979990   3
2022-01-29   -0.666001  1.324261 -0.589492 -1.734960   6

reindex方法使得能修改指定轴上的值

In [56]:
df2 = df.reindex(index=data[0:3],columns=list(df.columns)+['6'])
df2.loc[data[0]:data[1],'6'] = 1.1
df2

                     1         2         3         4   5    6
2022-01-23  100.000000  0.217097 -1.489770  0.042462  10  1.1
2022-01-24   -1.160795 -0.259789 -1.390047 -0.071024   7  1.1
2022-01-25    0.956457  0.250320  1.871723 -0.489799   3  NaN

删除丢失数据的任何行

In [57]:
df2.dropna(how='any')

                     1         2         3         4   5    6
2022-01-23  100.000000  0.217097 -1.489770  0.042462  10  1.1
2022-01-24   -1.160795 -0.259789 -1.390047 -0.071024   7  1.1

填充缺失数据

In [58]:
df2.fillna(value=3.14)

                     1         2         3         4   5     6
2022-01-23  100.000000  0.217097 -1.489770  0.042462  10  1.10
2022-01-24   -1.160795 -0.259789 -1.390047 -0.071024   7  1.10
2022-01-25    0.956457  0.250320  1.871723 -0.489799   3  3.14

获取值为 NaN 的布尔掩码

In [59]:
pd.isna(df2)

                1      2      3      4      5      6
2022-01-23  False  False  False  False  False  False
2022-01-24  False  False  False  False  False  False
2022-01-25  False  False  False  False  False   True

执行描述性统计

In [60]:
df.mean() #按列

1    13.597035
2     0.089138
3    -0.050159
4    -0.237186
5     5.000000
dtype: float64

In [61]:
df.mean(1) #按行

2022-01-23    21.753958
2022-01-24     0.823669
2022-01-25     1.117740
2022-01-26    -0.403395
2022-01-27     0.757103
2022-01-28     0.842522
2022-01-29     0.866762
Freq: D, dtype: float64

apply方法

In [62]:
df.apply(lambda x:abs(x))

                     1         2         3         4   5
2022-01-23  100.000000  0.217097  1.489770  0.042462  10
2022-01-24    1.160795  0.259789  1.390047  0.071024   7
2022-01-25    0.956457  0.250320  1.871723  0.489799   3
2022-01-26    1.565191  1.099889  0.232267  1.119627   2
2022-01-27    1.032809  0.597634  0.683309  0.732652   4
2022-01-28    1.352415  0.789602  0.795431  0.979990   3
2022-01-29    0.666001  1.324261  0.589492  1.734960   6

值统计

In [64]:
df['5'].value_counts()

3     2
10    1
7     1
2     1
4     1
6     1
Name: 5, dtype: int64

合并操作

In [66]:
df3 = pd.DataFrame(np.random.randn(3,3))
df4 = pd.DataFrame(np.random.randn(3,3))
pd.concat([df3,df4],axis=1) #0按行，1按列

          0         1         2         0         1         2
0 -0.849499 -1.778028  0.390541 -0.194693 -1.181585  0.418370
1  0.678684  0.305163  1.101141  1.006031 -0.257978  0.768402
2  0.479821  1.439479  0.851954  2.167510 -1.329510  0.217700

时序操作

In [69]:
rng = pd.date_range('23/1/2022 12:27',periods=7,freq='D')
ts = pd.Series(np.random.randn(len(rng)),rng)
ts

2022-01-23 12:27:00   -1.565175
2022-01-24 12:27:00   -1.854183
2022-01-25 12:27:00   -1.597913
2022-01-26 12:27:00   -0.857578
2022-01-27 12:27:00   -0.434192
2022-01-28 12:27:00   -0.288725
2022-01-29 12:27:00    0.543940
Freq: D, dtype: float64

In [70]:
ts_utc = ts.tz_localize('UTC')
ts_utc

2022-01-23 12:27:00+00:00   -1.565175
2022-01-24 12:27:00+00:00   -1.854183
2022-01-25 12:27:00+00:00   -1.597913
2022-01-26 12:27:00+00:00   -0.857578
2022-01-27 12:27:00+00:00   -0.434192
2022-01-28 12:27:00+00:00   -0.288725
2022-01-29 12:27:00+00:00    0.543940
Freq: D, dtype: float64

转为其他时区

In [71]:
ts_utc.tz_convert('US/Eastern')

2022-01-23 07:27:00-05:00   -1.565175
2022-01-24 07:27:00-05:00   -1.854183
2022-01-25 07:27:00-05:00   -1.597913
2022-01-26 07:27:00-05:00   -0.857578
2022-01-27 07:27:00-05:00   -0.434192
2022-01-28 07:27:00-05:00   -0.288725
2022-01-29 07:27:00-05:00    0.543940
Freq: D, dtype: float64

写成csv文件、excel文件

In [72]:
df.to_excel('random.xlsx')

In [73]:
df.to_csv('mycsv.csv')

读取csv文件

In [74]:
pd.read_csv('mycsv.csv')

   Unnamed: 0           1         2         3         4   5
0  2022-01-23  100.000000  0.217097 -1.489770  0.042462  10
1  2022-01-24   -1.160795 -0.259789 -1.390047 -0.071024   7
2  2022-01-25    0.956457  0.250320  1.871723 -0.489799   3
3  2022-01-26   -1.565191 -1.099889 -0.232267 -1.119627   2
4  2022-01-27   -1.032809 -0.597634  0.683309  0.732652   4
5  2022-01-28   -1.352415  0.789602  0.795431  0.979990   3
6  2022-01-29   -0.666001  1.324261 -0.589492 -1.734960   6